export default function page() {
  return (
    <div className="w-full sm:w-[900px] mx-auto mt-30">
      1. 개인정보처리방침 (예시) 마이웨딩다이어리 개인정보처리방침 제1조 (총칙)
      마이웨딩다이어리은(는) 정보통신망 이용촉진 및 정보보호 등에 관한 법률,
      개인정보보호법 등 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에
      의거한 개인정보처리방침을 정하여 이용자 권익 보호에 최선을 다하고
      있습니다. 본 개인정보처리방침은 회사가 제공하는 마이웨딩다이어리 관련 제반
      서비스(https://www.google.com/search?q=%EC%9D%B4%ED%95%98 "서비스")에
      적용되며, 다음과 같은 내용을 담고 있습니다. 제2조 (수집하는 개인정보의
      항목 및 수집방법) 회사는 회원가입, 원활한 고객상담, 각종 서비스의 제공
      등을 위해 최초 회원가입 당시 아래와 같은 개인정보를 수집하고 있습니다.
      필수항목: 닉네임, 이메일 주소, 비밀번호 (비밀번호는 암호화되어 저장)
      선택항목 (마이페이지 정보 입력 시): 결혼 예정일, 결혼 예정 지역, 결혼
      예산, 예상 하객 수 등 이용자가 직접 입력하는 정보 서비스 이용 과정이나
      사업 처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수
      있습니다: IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록,
      기기 정보 수집방법: 홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일,
      이벤트 응모 협력회사로부터의 제공 생성정보 수집 툴을 통한 수집 제3조
      (개인정보의 수집 및 이용목적) 회사는 수집한 개인정보를 다음의 목적을 위해
      활용합니다. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산:
      콘텐츠 제공, 특정 맞춤 서비스 제공, 본인인증 등 회원 관리: 회원제 서비스
      이용에 따른 본인확인, 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용
      방지, 가입 의사 확인, 연령확인, 불만처리 등 민원처리, 고지사항 전달 신규
      서비스 개발 및 마케팅·광고에의 활용 (마케팅 정보 수신에 동의한 경우에
      한함): 신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스
      제공 및 광고 게재, 서비스의 유효성 확인, 이벤트 및 광고성 정보 제공 및
      참여기회 제공, 접속빈도 파악, 회원의 서비스이용에 대한 통계 제4조
      (개인정보의 보유 및 이용기간) 이용자의 개인정보는 원칙적으로 개인정보의
      수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 다음의 정보에
      대해서는 아래의 이유로 명시한 기간 동안 보존합니다. 회사 내부 방침에 의한
      정보 보유 사유 부정이용기록: 부정 이용 방지를 위해 1년간 보존 관련 법령에
      의한 정보 보유 사유 계약 또는 청약철회 등에 관한 기록: 5년 (전자상거래
      등에서의 소비자보호에 관한 법률) 대금결제 및 재화 등의 공급에 관한 기록:
      5년 (전자상거래 등에서의 소비자보호에 관한 법률) 소비자의 불만 또는
      분쟁처리에 관한 기록: 3년 (전자상거래 등에서의 소비자보호에 관한 법률)
      본인확인에 관한 기록: 6개월 (정보통신망 이용촉진 및 정보보호 등에 관한
      법률) 웹사이트 방문기록: 3개월 (통신비밀보호법) 제5조 (개인정보의 파기절차
      및 방법) 회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당
      정보를 지체없이 파기합니다. 파기절차 및 방법은 다음과 같습니다. 파기절차:
      이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로
      옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한
      정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후
      파기됩니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는
      보유되는 이외의 다른 목적으로 이용되지 않습니다. 파기방법: 전자적
      파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여
      삭제합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여
      파기합니다. 제6조 (개인정보의 제3자 제공) 회사는 이용자들의 개인정보를
      "제3조 (개인정보의 수집 및 이용목적)"에서 고지한 범위 내에서 사용하며,
      이용자의 사전 동의 없이는 동 범위를 초과하여 이용하거나 원칙적으로
      이용자의 개인정보를 외부에 공개하지 않습니다. 다만, 아래의 경우에는 예외로
      합니다. 이용자들이 사전에 공개에 동의한 경우 법령의 규정에 의거하거나,
      수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우
      (만약 제3자 제공이 있다면 구체적인 제공받는 자, 목적, 항목, 보유기간 명시)
      제7조 (수집한 개인정보의 위탁) 회사는 서비스 향상을 위해서 아래와 같이
      개인정보를 위탁하고 있으며, 관계 법령에 따라 위탁계약 시 개인정보가
      안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. 회사의 개인정보
      위탁처리 기관 및 위탁업무 내용은 아래와 같습니다. (위탁 업체가 있다면
      업체명, 위탁업무 내용 명시. 없다면 "회사는 이용자의 동의없이 이용자의
      정보를 외부 업체에 위탁하지 않습니다. 향후 그러한 필요가 생길 경우, 위탁
      대상자와 위탁 업무 내용에 대해 이용자에게 통지하고 필요한 경우 사전 동의를
      받도록 하겠습니다." 와 같이 명시) 제8조 (이용자 및 법정대리인의 권리와 그
      행사방법) 이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만
      14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할
      수도 있습니다. 이용자 혹은 만 14세 미만 아동의 개인정보 조회, 수정을
      위해서는 '개인정보변경'(또는 '회원정보수정' 등)을, 가입해지(동의철회)를
      위해서는 "회원탈퇴"를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정
      또는 탈퇴가 가능합니다. 혹은 개인정보보호책임자에게 서면, 전화 또는
      이메일로 연락하시면 지체없이 조치하겠습니다. 이용자가 개인정보의 오류에
      대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용
      또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한
      경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록
      하겠습니다. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된
      개인정보는 "제4조 (개인정보의 보유 및 이용기간)"에 명시된 바에 따라
      처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.
      제9조 (개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항) 회사는
      이용자에게 특화된 맞춤서비스를 제공하기 위해서 이용자들의 정보를 저장하고
      수시로 불러오는 '쿠키(cookie)'를 사용합니다. 쿠키는 웹사이트를 운영하는데
      이용되는 서버(HTTP)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며
      이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다. 쿠키의 사용 목적:
      이용자들이 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기
      검색어, 보안접속 여부, 이용자 규모 등을 파악하여 이용자에게 최적화된 정보
      제공을 위하여 사용합니다. 쿠키의 설치·운영 및 거부: 이용자는 쿠키 설치에
      대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹브라우저에서 옵션을
      설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나,
      아니면 모든 쿠키의 저장을 거부할 수도 있습니다. 설정방법 예(인터넷
      익스플로어의 경우): 웹 브라우저 상단의 도구 인터넷 옵션 개인정보 단, 쿠키
      설치를 거부하였을 경우 로그인이 필요한 일부 서비스 이용에 어려움이 있을 수
      있습니다. 제10조 (개인정보의 기술적/관리적 보호 대책) 회사는 이용자들의
      개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지
      않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고
      있습니다. 비밀번호 암호화: 회원 아이디(ID)의 비밀번호는 암호화되어 저장 및
      관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도 비밀번호를
      알고 있는 본인에 의해서만 가능합니다. 해킹 등에 대비한 대책: 회사는
      해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는
      것을 막기 위해 최선을 다하고 있습니다. 개인정보의 훼손에 대비해서 자료를
      수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의 개인정보나
      자료가 유출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여
      네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 그리고
      침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타
      시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려
      노력하고 있습니다. 처리 직원의 최소화 및 교육: 회사의 개인정보관련 처리
      직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여
      정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여
      개인정보처리방침의 준수를 항상 강조하고 있습니다. 개인정보보호전담기구의
      운영: 그리고 사내 개인정보보호전담기구 등을 통하여 개인정보처리방침의
      이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 수정하고
      바로 잡을 수 있도록 노력하고 있습니다. 단, 이용자 본인의 부주의나
      인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해
      회사는 일체의 책임을 지지 않습니다. 제11조 (개인정보보호책임자 및 담당자의
      연락처) 귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호
      관련 민원을 개인정보보호책임자 혹은 담당부서로 신고하실 수 있습니다.
      회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.
      개인정보보호책임자 이름: 박영호 소속: 개발부서 직위: 대표 전화번호:
      010-8285-5136 이메일: snu910501@naver.com 기타 개인정보침해에 대한 신고나
      상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
      개인정보침해신고센터 (privacy.kisa.or.kr / 국번없이 118) 대검찰청
      사이버수사과 (www.spo.go.kr / 국번없이 1301) 경찰청 사이버안전국
      (cyberbureau.police.go.kr / 국번없이 182) 제12조 (고지의 의무) 현
      개인정보처리방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터
      홈페이지의 "공지사항"을 통해 고지할 것입니다. 다만, 개인정보의 수집 및
      활용, 제3자 제공 등과 같이 이용자 권리의 중요한 변경이 있을 경우에는 최소
      30일 전에 고지합니다. 공고일자: 2025-05-20 시행일자: 2025-05-20
    </div>
  );
}
